# Read & Write Database tables using Pandas

In [1]:
import pandas as pd

In [2]:
import sqlalchemy #sqlalchemy is the ORM tool for Python

In [3]:
pip install pymysql

Requirement already satisfied: pymysql in c:\users\saumyanti\anaconda3\lib\site-packages (1.1.0)
Note: you may need to restart the kernel to use updated packages.

In [4]:
engine = sqlalchemy.create_engine('mysql+pymysql://root:root@localhost:3306/pandas_example') #engine has created with connection string

### Read from a Database Table

In [5]:
df = pd.read_sql_table('customer', engine)

df

    id    name     mobile        city
0  101  Pritam  972342531       Delhi
1  102  Robert  239376589  New Jersey
2  103    John  789302089      London

### Run Query on a Database Table

In [6]:
query = 'select id,name from customer'
query_df = pd.read_sql_query(query, engine)

query_df

    id    name
0  101  Pritam
1  102  Robert
2  103    John

### Modify & Write a Dataframe to a Database Table

In [7]:
new_df = pd.DataFrame([[104, 'Joe', 890342789, 'California']], columns=['id','name','mobile','city'])

new_df

    id name     mobile        city
0  104  Joe  890342789  California

In [8]:
df = pd.concat([df, new_df])

In [9]:
df

    id    name     mobile        city
0  101  Pritam  972342531       Delhi
1  102  Robert  239376589  New Jersey
2  103    John  789302089      London
0  104     Joe  890342789  California

In [10]:
df.to_sql(
    name='customer_info',
    con=engine,
    index=False,
    if_exists ='replace'

)

4